In [1]:
import pandas as pd
import numpy as np

In [2]:
# from a list of lists
data = [['John', 25], ['Alice', 35], ['Bob', 28]]
pd.DataFrame(data, columns=['Name', 'Age'])

    Name  Age
0   John   25
1  Alice   35
2    Bob   28

In [3]:
# from a dictionary
data = {'Name': ['John', 'Alice', 'Bob'], 'Age':[25, 35, 28]}
pd.DataFrame(data)

    Name  Age
0   John   25
1  Alice   35
2    Bob   28

In [4]:
# from a list of dictionaries
data = [{'Name':'John', 'Age':25}, {'Name':'Alice', 'Age':35}, {'Name':'Bob', 'Age':28}]
pd.DataFrame(data)

    Name  Age
0   John   25
1  Alice   35
2    Bob   28

In [5]:
# from a numpy array
data = np.array([['John', 25], ['Alice', 35], ['Bob', 28]])
df = pd.DataFrame(data, columns=['Name', 'Age'])
df

    Name Age
0   John  25
1  Alice  35
2    Bob  28

In [6]:
df['Name']

0     John
1    Alice
2      Bob
Name: Name, dtype: object

In [7]:
df.Age

0    25
1    35
2    28
Name: Age, dtype: object

In [8]:
df[['Age', 'Name']] # change column order

  Age   Name
0  25   John
1  35  Alice
2  28    Bob

In [9]:
df.columns

Index(['Name', 'Age'], dtype='object')

In [10]:
for col in list(df.columns):
    pass
list(df.columns)

['Name', 'Age']

In [11]:
df.iloc[1] # uses the index of row

Name    Alice
Age        35
Name: 1, dtype: object

In [12]:
df.loc[1] 
# uses the name of the row, in this case the name is the same as the index,
# watch the first column (index col) of df from the left

Name    Alice
Age        35
Name: 1, dtype: object

In [13]:
new_index_list = ['Emp1', 'Emp2', 'Emp3']
df.index = new_index_list
df

       Name Age
Emp1   John  25
Emp2  Alice  35
Emp3    Bob  28

In [14]:
# df.loc[1]  will now throw an error because the new name is 'Emp2'
df.loc['Emp2']

Name    Alice
Age        35
Name: Emp2, dtype: object

In [15]:
df.iloc[[0,1]] # access rows 0,1

       Name Age
Emp1   John  25
Emp2  Alice  35

In [16]:
df.iloc[[0,1],1] # access rows 0,1 and column 1

Emp1    25
Emp2    35
Name: Age, dtype: object

In [17]:
df.loc[['Emp1','Emp2'],['Age']] # access rows and columns by name

     Age
Emp1  25
Emp2  35

In [18]:
df = df.set_index('Name') # set the index column (deleting previous row names)
df

      Age
Name
John   25
Alice  35
Bob    28

In [19]:
df.index.name = 'Employee_id' # rename index column name
df

            Age
Employee_id
John         25
Alice        35
Bob          28

In [22]:
df = pd.read_csv('survey_results_public.csv')
df.tail()

,ResponseId,Q120,MainBranch,Age,Employment,RemoteWork,CodingActivities,EdLevel,LearnCode,LearnCodeOnline,...,Frequency_1,Frequency_2,Frequency_3,TimeSearching,TimeAnswering,ProfessionalTech,Industry,SurveyLength,SurveyEase,ConvertedCompYearly
89179,89180,I agree,I am a developer by profession,25-34 years old,"Employed, full-time;Independent contractor, fr...",Remote,Hobby;Bootstrapping a business;Freelance/contr...,"Associate degree (A.A., A.S., etc.)",Online Courses or Certification;Other online r...,Formal documentation provided by the owner of ...,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Too long,Neither easy nor difficult,NaN
89180,89181,I agree,I am a developer by profession,18-24 years old,"Student, full-time;Employed, part-time","Hybrid (some remote, some in-person)",School or academic work,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)",Colleague;Online Courses or Certification;Othe...,Formal documentation provided by the owner of ...,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Too long,Easy,NaN
89181,89182,I agree,I code primarily as a hobby,Prefer not to say,I prefer not to say,NaN,NaN,Something else,Books / Physical media;Hackathons (virtual or ...,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Too long,Neither easy nor difficult,NaN
89182,89183,I agree,I am a developer by profession,Under 18 years old,"Employed, part-time;Student, part-time","Hybrid (some remote, some in-person)",Hobby;School or academic work,"Secondary school (e.g. American high school, G...",Online Courses or Certification;Other online r...,Formal documentation provided by the owner of ...,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Appropriate in length,Neither easy nor difficult,NaN
89183,89184,I agree,I am a developer by profession,35-44 years old,"Employed, full-time","Hybrid (some remote, some in-person)",Hobby;Professional development or self-paced l...,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)",Colleague;Online Courses or Certification;Othe...,Formal documentation provided by the owner of ...,...,Never,1-2 times a week,1-2 times a week,60-120 minutes a day,30-60 minutes a day,DevOps function;Developer portal or other cent...,"Information Services, IT, Software Development...",Appropriate in length,Easy,NaN

In [23]:
df.shape

(89184, 84)

In [27]:
df.loc[:4,'Industry':'ConvertedCompYearly']

,Industry,SurveyLength,SurveyEase,ConvertedCompYearly
0,NaN,NaN,NaN,NaN
1,"Information Services, IT, Software Development...",Appropriate in length,Easy,285000.0
2,"Information Services, IT, Software Development...",Appropriate in length,Easy,250000.0
3,NaN,Appropriate in length,Easy,156000.0
4,Other,Appropriate in length,Neither easy nor difficult,23456.0

In [28]:
df.describe()

         ResponseId     CompTotal       WorkExp  ConvertedCompYearly
count  89184.000000  4.822500e+04  43579.000000         4.801900e+04
mean   44592.500000  1.036807e+42     11.405126         1.031101e+05
std    25745.347541  2.276847e+44      9.051989         6.814188e+05
min        1.000000  0.000000e+00      0.000000         1.000000e+00
25%    22296.750000  6.300000e+04      5.000000         4.390700e+04
50%    44592.500000  1.150000e+05      9.000000         7.496300e+04
75%    66888.250000  2.300000e+05     16.000000         1.216410e+05
max    89184.000000  5.000000e+46     50.000000         7.435143e+07

In [32]:
# df.info()
df.isnull().sum()

ResponseId                 0
Q120                       0
MainBranch                 0
Age                        0
Employment              1286
                       ...
ProfessionalTech       47401
Industry               52410
SurveyLength            2699
SurveyEase              2630
ConvertedCompYearly    41165
Length: 84, dtype: int64